Revit 2024 API
SpatialFieldManager.NumberOfMeasurements Property
 Stores the total number of measurements
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public int NumberOfMeasurements { get; }
Visual Basic
Public ReadOnly Property NumberOfMeasurements As Integer
	Get
Visual C++
public:
property int NumberOfMeasurements {
	int get ();
}
Remarks
 This number defines the length of value arrays in ValueAtPoint objects
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace